jvmreis/nxp_interrupt_lesson/bar_metal/board/pin_mux.c
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_08_LCD_DATA04,           /* GPIO_B0_08 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_09_LCD_DATA05,           /* GPIO_B0_09 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_10_LCD_DATA06,           /* GPIO_B0_10 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_11_LCD_DATA07,           /* GPIO_B0_11 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_12_LCD_DATA08,           /* GPIO_B0_12 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_13_LCD_DATA09,           /* GPIO_B0_13 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_14_LCD_DATA10,           /* GPIO_B0_14 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_15_LCD_DATA11,           /* GPIO_B0_15 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_00_LCD_DATA12,           /* GPIO_B1_00 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_01_LCD_DATA13,           /* GPIO_B1_01 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_02_LCD_DATA14,           /* GPIO_B1_02 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_03_LCD_DATA15,           /* GPIO_B1_03 PAD functional properties : */
      0x01B0B0U);                             /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Pull-up or pull-down (determined by PUS field).
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Enabled (Schmitt Trigger input) */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_15_GPIO2_IO31,           /* GPIO_B1_15 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V
                                                 Speed Field: 100MHz - 150MHz
                                                 Open Drain Enable Field: Open Drain Disabled (Output is CMOS)
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.: Keep the previous output value when the output driver is disabled.
                                                 Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled (CMOS input) */
}

